Tekla.Structures.Drawing.PropertyElement.PropertyElementType.SectionMarkPropertyElementTypes
The SectionMarkPropertyElementTypes class represents the available property element types for section marks.

Tekla.Structures.Drawing.PropertyElement.PropertyElementType.SectionMarkPropertyElementTypes.SectionName
Returns the section name property element type.
Returns: The requested property element type.

Tekla.Structures.Drawing.PropertyElement.PropertyElementType.SectionMarkPropertyElementTypes.SourceDrawingName
Returns the source drawing name property element type.
Returns: The requested property element type.

Tekla.Structures.Drawing.PropertyElement.PropertyElementType.SectionMarkPropertyElementTypes.SourceDrawingNameWhenMoved
Returns the source drawing name when moved property element type.
Returns: The requested property element type.